# Сформувати масив всіх ключів вхідного хешу, які підпадають під визначений критерій

# Ви маєте записати у змінну results множину ключів хешу input_hash, 
# довжина яких строго більше 3 символів

class Calculator
  def hash_key_criteria input_hash

    # вхідний хеш записуватиметься у змінну temp

    temp = input_hash
    #
    # # вибираємо всі ключі з хешу
    # ...
    #
    # # формуємо множину ключів, довжина яких більше 3 символів
    # ...

    # тут його слід вивести
    puts temp.keys.map { |key| key if key.length > 3 }

  end
end
